; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 708091 2 2 2 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Star0 - direction
	GroundStation6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite1 Star11)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 spectrograph1)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Star11 spectrograph1)
	(have_image Planet12 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
4. (turn_to satellite1 groundstation6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 7
5. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 7
6. (turn_to satellite0 star11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star11)
   goals met: 0 of 7
7. (turn_to satellite1 star7 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star7)
   goals met: 0 of 7
8. (turn_to satellite0 planet12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet12)
   goals met: 0 of 7
9. (take_image satellite1 star7 instrument2 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 1 of 7
10. (turn_to satellite0 phenomenon9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 7
11. (turn_to satellite1 star11 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star11)
   goals met: 2 of 7
12. (turn_to satellite0 star5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star5)
   goals met: 2 of 7
13. (take_image satellite1 star11 instrument2 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 3 of 7
14. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 3 of 7
15. (turn_to satellite1 planet12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet12)
   goals met: 2 of 7
16. (turn_to satellite0 phenomenon9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 7
17. (take_image satellite0 phenomenon9 instrument0 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 3 of 7
18. (take_image satellite1 planet12 instrument2 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 4 of 7
19. (turn_to satellite1 star11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star11)
   goals met: 5 of 7
20. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 7
21. (take_image satellite0 phenomenon8 instrument0 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 6 of 7
22. (turn_to satellite1 phenomenon10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 7
23. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 7
24. (take_image satellite1 phenomenon10 instrument2 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 6 of 7
25. (turn_to satellite1 star11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star11)
   goals met: 7 of 7
